results/SCI-065/files/results/openfoam_cases/flow_5p0_ml_min/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
convertToMeters 1.0;

vertices
(
    (0.00049952411 -2.1809694e-05 0)
    (0.039961929 -0.0017447755 0)
    (0.00049952411 2.1809694e-05 0)
    (0.039961929 0.0017447755 0)
    (0.00049952411 -2.1809694e-05 0.12)
    (0.039961929 -0.0017447755 0.12)
    (0.00049952411 2.1809694e-05 0.12)
    (0.039961929 0.0017447755 0.12)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (48 1 96) simpleGrading (1 1 1)
);

edges
(
    arc 0 2 (0.0005 0 0)
    arc 1 3 (0.04 0 0)
    arc 4 6 (0.0005 0 0.12)
    arc 5 7 (0.04 0 0.12)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 3 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 7 6)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (1 3 7 5)
        );
    }
    core
    {
        type symmetryPlane;
        faces
        (
            (0 4 6 2)
        );
    }
    wedgeLow
    {
        type wedge;
        faces
        (
            (0 1 5 4)
        );
    }
    wedgeHigh
    {
        type wedge;
        faces
        (
            (2 6 7 3)
        );
    }
);

mergePatchPairs
(
);
